MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/tim/implementation_2/hal_ll_tim.c
static inline void _hal_ll_tim20_set_clock( bool hal_ll_state ) {
	if ( hal_ll_state ) {
		set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_20 );
	} else {
		clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_20 );
	}
}

static inline void _hal_ll_tim21_set_clock( bool hal_ll_state ) {
	if ( hal_ll_state ) {
		set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_21 );
	} else {
		clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_21 );
	}
}

static inline void _hal_ll_tim22_set_clock( bool hal_ll_state ) {
	if ( hal_ll_state ) {
		set_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_22 );
	} else {
		clear_reg_bit( _RCC_APB2ENR, HAL_LL_TIM_ENABLE_22 );
	}
}

static hal_ll_pin_name_t _hal_ll_tim_check_pin( hal_ll_pin_name_t pin, uint8_t *index, hal_ll_tim_handle_register_t *handle_map ) {

    hal_ll_pin_name_t pin_num;
    uint8_t index_counter = 0;
    uint8_t hal_ll_module_id = 0;
    uint16_t map_size = ( sizeof( _tim_map ) / sizeof( hal_ll_tim_pin_map_t ) );

    if ( HAL_LL_PIN_NC == pin ) {
        return HAL_LL_PIN_NC;
    }

	// Check if the selected pin is valid.
	for ( pin_num = 0; pin_num < map_size; pin_num++ ) {
		if ( _tim_map[ pin_num ].pin == pin ) {
            // Get module number
            hal_ll_module_id = _tim_map[ pin_num ].module_index;
            if ( NULL == handle_map[hal_ll_module_id].hal_drv_tim_handle ) {
                *index = pin_num;
                return hal_ll_module_id;
            } else if ( TIM_MODULE_COUNT == ++index_counter ) {
                return --index_counter;
            }
        }
	}
	// By default return last error msg.
	if ( index_counter ) {
        return hal_ll_module_id;
    } else {
        return HAL_LL_PIN_NC;
    }
}

static hal_ll_tim_hw_specifics_map_t *hal_ll_get_specifics( handle_t handle ) {

    uint8_t hal_ll_module_count = sizeof( hal_ll_module_state ) / ( sizeof( hal_ll_tim_handle_register_t ) );;
    static uint8_t hal_ll_module_error = hal_ll_module_count;

    while( hal_ll_module_count-- ) {
        if ( hal_ll_tim_get_base_from_hal_handle == hal_ll_tim_hw_specifics_map [ hal_ll_module_count ].base ) {
            return &hal_ll_tim_hw_specifics_map[ hal_ll_module_count ];
        }
    }

    return &hal_ll_tim_hw_specifics_map[ hal_ll_module_error ];
}

static void _hal_ll_tim_set_clock( hal_ll_base_addr_t base, bool hal_ll_state ) {

	switch ( ( uint32_t )base ) { // 32-bit base address.
	#ifdef TIM_MODULE_1
		case ( HAL_LL_TIM1_BASE_ADDR ):
			_hal_ll_tim1_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_2
		case ( HAL_LL_TIM2_BASE_ADDR ):
			_hal_ll_tim2_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_3
		case ( HAL_LL_TIM3_BASE_ADDR ):
			_hal_ll_tim3_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_4
		case ( HAL_LL_TIM4_BASE_ADDR ):
			_hal_ll_tim4_set_clock( hal_ll_state );
			break;
	#endif
    #ifdef TIM_MODULE_5
		case ( HAL_LL_TIM5_BASE_ADDR ):
			_hal_ll_tim5_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_8
		case ( HAL_LL_TIM8_BASE_ADDR ):
			_hal_ll_tim8_set_clock( hal_ll_state );
			break;
	#endif
    #ifdef TIM_MODULE_9
		case ( HAL_LL_TIM9_BASE_ADDR ):
			_hal_ll_tim9_set_clock( hal_ll_state );
			break;
	#endif
    #ifdef TIM_MODULE_10
		case ( HAL_LL_TIM10_BASE_ADDR ):
			_hal_ll_tim10_set_clock( hal_ll_state );
			break;
	#endif
    #ifdef TIM_MODULE_11
		case ( HAL_LL_TIM11_BASE_ADDR ):
			_hal_ll_tim11_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_12
		case ( HAL_LL_TIM12_BASE_ADDR ):
			_hal_ll_tim12_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_13
		case ( HAL_LL_TIM13_BASE_ADDR ):
			_hal_ll_tim13_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_14
		case ( HAL_LL_TIM14_BASE_ADDR ):
			_hal_ll_tim14_set_clock( hal_ll_state );
			break;
	#endif
		#ifdef TIM_MODULE_15
		case ( HAL_LL_TIM15_BASE_ADDR ):
			_hal_ll_tim15_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_16
		case ( HAL_LL_TIM16_BASE_ADDR ):
			_hal_ll_tim16_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_17
		case ( HAL_LL_TIM17_BASE_ADDR ):
			_hal_ll_tim17_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_19
		case ( HAL_LL_TIM19_BASE_ADDR ):
			_hal_ll_tim19_set_clock( hal_ll_state );
			break;
	#endif
	#ifdef TIM_MODULE_20
		case ( HAL_LL_TIM20_BASE_ADDR ):
			_hal_ll_tim20_set_clock( hal_ll_state );
			break;
	#endif
    #ifdef TIM_MODULE_21
		case ( HAL_LL_TIM21_BASE_ADDR ):
			_hal_ll_tim21_set_clock( hal_ll_state );
			break;
	#endif
    #ifdef TIM_MODULE_22
		case ( HAL_LL_TIM22_BASE_ADDR ):
			_hal_ll_tim22_set_clock( hal_ll_state );
			break;
	#endif
	}
}

static uint32_t _hal_ll_tim_clock_source( uint8_t selector ) {

    rcc_clocks_t rcc_clocks;

    RCC_GetClocksFrequency( &rcc_clocks );

    #if defined(STM32F0xx) || defined(STM32G0xx)
        if( rcc_clocks.hclk/rcc_clocks.pclk > 1 ) {
            return rcc_clocks.pclk * 2;
        } else {
            return rcc_clocks.pclk;
        }
    #else
    if( selector == HAL_LL_APB1_TIMER_CLOCK ) {
        if( rcc_clocks.hclk/rcc_clocks.pclk1 > 1 ) {
            return rcc_clocks.pclk1 * 2;
        } else {
            return rcc_clocks.pclk1;
        }
    } else if( selector == HAL_LL_APB2_TIMER_CLOCK ) {
        if( rcc_clocks.hclk/rcc_clocks.pclk2 > 1 ) {
            return rcc_clocks.pclk2 * 2;
        } else {
            return rcc_clocks.pclk2;
        }
    }
    #endif
    return 0;
}

static uint32_t _hal_ll_tim_get_clock_speed( hal_ll_base_addr_t base ) {

    switch ( ( uint32_t )base ) {
        #ifdef TIM_MODULE_1
        case ( HAL_LL_TIM1_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM1_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_2
        case ( HAL_LL_TIM2_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM2_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_3
        case ( HAL_LL_TIM3_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM3_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_4
        case ( HAL_LL_TIM4_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM4_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_5
        case ( HAL_LL_TIM5_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM5_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_8
        case ( HAL_LL_TIM8_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM8_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_9
        case ( HAL_LL_TIM9_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM9_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_10
        case ( HAL_LL_TIM10_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM10_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_11
        case ( HAL_LL_TIM11_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM11_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_12
        case ( HAL_LL_TIM12_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM12_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_13
        case ( HAL_LL_TIM13_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM13_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_14
        case ( HAL_LL_TIM14_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM14_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_15
        case ( HAL_LL_TIM15_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM15_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_16
        case ( HAL_LL_TIM16_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM16_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_17
        case ( HAL_LL_TIM17_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM17_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_19
        case ( HAL_LL_TIM19_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM19_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_20
        case ( HAL_LL_TIM20_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM20_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_21
        case ( HAL_LL_TIM21_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM21_BUS );
            break;
        #endif
        #ifdef TIM_MODULE_22
        case ( HAL_LL_TIM22_BASE_ADDR ):
            return _hal_ll_tim_clock_source( TIM22_BUS );
            break;
        #endif
    }
    return 0;
}

static void _hal_ll_tim_map_pin( uint8_t module_index, uint8_t index ) {

